In [6]:
import pandas as pd

# Series

In [250]:
data= [1,2,3,4,5]

In [251]:
s = pd.Series(data)

In [252]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [253]:
index = ['Linha'+ str(i) for i in range(5)]

In [254]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [255]:
s = pd.Series(data=data,index=index)

In [256]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [257]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [258]:
s = pd.Series(data)

In [259]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [260]:
s1= s+1

In [261]:
s1

Linha0    2
Linha1    3
Linha2    4
Linha3    5
Linha4    6
dtype: int64

In [262]:
s2=s+s1

In [263]:
s2

Linha0     3
Linha1     5
Linha2     7
Linha3     9
Linha4    11
dtype: int64

## DataFrames

In [264]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [265]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [266]:
pd.DataFrame (data)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [267]:
index = ['Linha' + str(i) for i in range(3)]

In [268]:
index

['Linha0', 'Linha1', 'Linha2']

In [282]:
df1= pd.DataFrame (data= data, index=index, columns = columns)

In [283]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [284]:
columns= ['Coluna' + str(i) for i in range(3)]

In [285]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [286]:
df2=pd.DataFrame(data=data, index=index, columns=columns)

In [287]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [288]:
datas = {'Coluna0' : {'Linha0' : 1, 'Linha1' : 4, 'Linha2': 7} ,
        'Coluna1' : {'Linha0' : 2, 'Linha1' : 5, 'Linha2' : 8} ,
        'Coluna2' : {'Linha0' : 3, 'Linha1' : 6, 'Linha2': 9}}

In [289]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [290]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [291]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [292]:
df2[df2 > 0] ='B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [293]:
df3[df3 > 0 ] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [295]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [297]:
df4 = pd.concat([df1, df2, df3], axis=1 )
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C